{
    "certification_name": "AZ-900: Microsoft Azure Fundamentals",
    "date_measured": "July 31, 2023",
    "audience_profile": {
        "description": "Candidates for this exam are technology professionals who want to demonstrate foundational knowledge of cloud concepts in general and Azure in particular. This certification is a common starting point in a journey towards a career in Azure.",
        "capabilities": [
            "Describe Azure architectural components and Azure services, such as compute, networking, and storage.",
            "Describe features and tools to secure, govern, and administer Azure."
        ],
        "background": "Candidates for this exam have skills and experience working with an area of information technology (IT), such as infrastructure management, database management, or software development."
    },
    "sections": {
        "describe_cloud_concepts": {
            "percentage": "25–30%",
            "topics": [
                "Describe cloud computing",
                "Define cloud computing",
                "Describe the shared responsibility model",
                "Define cloud models, including public, private, and hybrid",
                "Identify appropriate use cases for each cloud model",
                "Describe the consumption-based model",
                "Compare cloud pricing models",
                "Describe serverless",
                {
                    "benefits_of_using_cloud_services": [
                        "Describe the benefits of high availability and scalability in the cloud",
                        "Describe the benefits of reliability and predictability in the cloud",
                        "Describe the benefits of security and governance in the cloud",
                        "Describe the benefits of manageability in the cloud"
                    ]
                },
                {
                    "cloud_service_types": [
                        "Describe infrastructure as a service (IaaS)",
                        "Describe platform as a service (PaaS)",
                        "Describe software as a service (SaaS)",
                        "Identify appropriate use cases for each cloud service (IaaS, PaaS, and SaaS)"
                    ]
                }
            ]
        },
        "describe_azure_architecture_and_services": {
            "percentage": "35–40%",
            "topics": [
                {
                    "core_architectural_components": [
                        "Describe Azure regions, region pairs, and sovereign regions",
                        "Describe availability zones",
                        "Describe Azure datacenters",
                        "Describe Azure resources and resource groups",
                        "Describe subscriptions",
                        "Describe management groups",
                        "Describe the hierarchy of resource groups, subscriptions, and management groups"
                    ]
                },
                {
                    "compute_and_networking_services": [
                        "Compare compute types, including containers, virtual machines, and functions",
                        "Describe virtual machine options, including Azure virtual machines, Azure Virtual Machine Scale Sets, availability sets, and Azure Virtual Desktop",
                        "Describe the resources required for virtual machines",
                        "Describe application hosting options, including web apps, containers, and virtual machines",
                        "Describe virtual networking, including the purpose of Azure virtual networks, Azure virtual subnets, peering, Azure DNS, Azure VPN Gateway, and ExpressRoute",
                        "Define public and private endpoints"
                    ]
                },
                {
                    "storage_services": [
                        "Compare Azure Storage services",
                        "Describe storage tiers",
                        "Describe redundancy options",
                        "Describe storage account options and storage types",
                        "Identify options for moving files, including AzCopy, Azure Storage Explorer, and Azure File Sync",
                        "Describe migration options, including Azure Migrate and Azure Data Box"
                    ]
                },
                {
                    "identity_access_and_security": [
                        "Describe directory services in Azure, including Azure Active Directory (Azure AD), part of Microsoft Entra and Azure Active Directory Domain Services (Azure AD DS)",
                        "Describe authentication methods in Azure, including single sign-on (SSO), multi-factor authentication (MFA), and passwordless",
                        "Describe external identities in Azure, including business-to-business (B2B) and business-to-customer (B2C)",
                        "Describe Conditional Access in Azure AD",
                        "Describe Azure role-based access control (RBAC)",
                        "Describe the concept of Zero Trust",
                        "Describe the purpose of the defense-in-depth model",
                        "Describe the purpose of Microsoft Defender for Cloud"
                    ]
                }
            ]
        },
        "describe_azure_management_and_governance": {
            "percentage": "30–35%",
            "topics": [
                {
                    "cost_management_in_azure": [
                        "Describe factors that can affect costs in Azure",
                        "Compare the pricing calculator and the Total Cost of Ownership (TCO) Calculator",
                        "Describe cost management capabilities in Azure",
                        "Describe the purpose of tags"
                    ]
                },
                {
                    "features_and_tools_in_azure_for_governance_and_compliance": [
                        "Describe the purpose of Microsoft Purview in Azure",
                        "Describe the purpose of Azure Policy",
                        "Describe the purpose of resource locks"
                    ]
                },
                {
                    "features_and_tools_for_managing_and_deploying_azure_resources": [
                        "Describe the Azure portal",
                        "Describe Azure Cloud Shell, including Azure Command-Line Interface (CLI) and Azure PowerShell",
                        "Describe the purpose of Azure Arc",
                        "Describe infrastructure as code (IaC)",
                        "Describe Azure Resource Manager (ARM) and ARM templates"
                    ]
                },
                {
                    "monitoring_tools_in_azure": [
                        "Describe the purpose of Azure Advisor",
                        "Describe Azure Service Health",
                        "Describe Azure Monitor, including Log Analytics, Azure Monitor alerts, and Application Insights"
                    ]
                }
            ]
        }
    }
}
